РазрешенияНаБСП24/src/Catalogs/Клиники/Клиники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>TNT</name>
      <description>CASH SALES MOW</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентскийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазрешенияНаБСП24/src/InformationRegisters/ИндексыГородов/ИндексыГородов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндексыГородов</name>
  <dimensions>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РазрешенияНаБСП24/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Клиники</owners>
  <attributes>
    <name>НаименованиеТранслит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазрешенияНаБСП24/src/Catalogs/Клиники/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
#Область СтандартныеПодсистемы

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
#КонецОбласти

	//Если Объект.ЭтоОтправитель И Не Пользователи.ЭтоПолноправныйПользователь() Тогда
	//	ЭтаФорма.Доступность = Ложь;
	//КонецЕсли;
	
	//Элементы.ЭтоОтправитель.Видимость = Пользователи.ЭтоПолноправныйПользователь();
	
	ЗаполнитьРеквизитыКонтактногоЛицаНаФорме();

	ТекущаяСтрана = Объект.Страна;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// Процедура обработчик события ПриОткрытии
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	//Если Объект.ЭтоОтправитель И Не ЗначениеЗаполнено(Объект.КлиентскийНомер) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен клиентский номер отправителя!", , "КлиентскийНомер", "Объект", Отказ);	
	//КонецЕсли;
	
	Если Не ПустаяСтрока(КонтактноеЛицоНаименование) Или Не ПустаяСтрока(КонтактноеЛицоТелефонныйКод) Или Не ПустаяСтрока(КонтактноеЛицоТелефон) Или Не ПустаяСтрока(КонтактноеЛицоЭлектроннаяПочта) Тогда
		
		Если ПустаяСтрока(КонтактноеЛицоНаименование) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено наименование контактного лица!", 	, "КонтактноеЛицоНаименование", 	, Отказ);	
		КонецЕсли;
		
		Если ПустаяСтрока(КонтактноеЛицоТелефонныйКод) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен телефонный код контактного лица!", 	, "КонтактноеЛицоТелефонныйКод", 	, Отказ);	
		КонецЕсли;
		
		Если ПустаяСтрока(КонтактноеЛицоТелефон) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен телефон контактного лица!", 			, "КонтактноеЛицоТелефон", 			, Отказ);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписатьКонтактноеЛицо();
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

// Процедура обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.НаименованиеТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыКонтактногоЛицаНаФорме();
	ДанныеКонтактногоЛицаИзменены = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	
	Объект.ГородТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.Город);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	
	Объект.АдресТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	
	Если Объект.Страна <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьГородПоИндексу();
	
	Если Элементы.ГородТранслит.СписокВыбора.Количество() > 0 Тогда
		Элементы.ГородТранслит.СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыборГородаЗавершение", ЭтаФорма), "Выберите город");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресТранслитПриИзменении(Элемент)

	Объект.АдресТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.АдресТранслит);	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАнглийскоеПриИзменении(Элемент)
	
	Объект.НаименованиеТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.НаименованиеТранслит);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНаименованиеПриИзменении(Элемент)
	
	ДанныеКонтактногоЛицаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоЭлектроннаяПочтаПриИзменении(Элемент)
	
	ДанныеКонтактногоЛицаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоТелефонныйКодПриИзменении(Элемент)
	
	ДанныеКонтактногоЛицаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоТелефонПриИзменении(Элемент)
	
	ДанныеКонтактногоЛицаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	
	Элементы.ГородТранслит.РедактированиеТекста 	= Объект.Страна <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	Элементы.ГородТранслит.КнопкаВыпадающегоСписка 	= Объект.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Если ТекущаяСтрана <> Объект.Страна Тогда
		Объект.Индекс 			= "";
		Объект.ГородТранслит 	= "";
	КонецЕсли;
	
	ТекущаяСтрана = Объект.Страна;
	
КонецПроцедуры

&НаКлиенте
Процедура ГородТранслитПриИзменении(Элемент)
	
	Объект.ГородТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.ГородТранслит);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеквизитыКонтактногоЛицаНаФорме()
	
	КонтактноеЛицоНаименование 		= Объект.КонтактноеЛицо.Наименование;
	КонтактноеЛицоЭлектроннаяПочта 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.КонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
	КонтактноеЛицоТелефонныйКод 	= Объект.КонтактноеЛицо.ТелефонныйКод;
	КонтактноеЛицоТелефон 			= Объект.КонтактноеЛицо.Телефон;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонтактноеЛицо()
	
	Если ДанныеКонтактногоЛицаИзменены Тогда
		
		Если Объект.КонтактноеЛицо.Пустая() Тогда
			КонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
		Иначе
			КонтактноеЛицо = Объект.КонтактноеЛицо.ПолучитьОбъект();
		КонецЕсли;
		
		КонтактноеЛицо.Наименование 		= КонтактноеЛицоНаименование;
		КонтактноеЛицо.НаименованиеТранслит = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(КонтактноеЛицоНаименование);
		
		УправлениеКонтактнойИнформациейРазрешения1C.ДобавитьАдресЭлектроннойПочтыКонтактногоЛица(КонтактноеЛицо, КонтактноеЛицоЭлектроннаяПочта, Истина);
		КонтактноеЛицо.ТелефонныйКод 		= КонтактноеЛицоТелефонныйКод;
		КонтактноеЛицо.Телефон 				= КонтактноеЛицоТелефон;
		КонтактноеЛицо.Владелец 			= Объект.Ссылка;
		
		КонтактноеЛицо.Записать();
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");		
		ТекущийОбъект.КонтактноеЛицо = КонтактноеЛицо.Ссылка;
		ТекущийОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКонтактногоЛицаПриИзменении()
	
	Модифицированность 				= Истина;
	ДанныеКонтактногоЛицаИзменены 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьГородПоИндексу()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Индекс", Объект.Индекс);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИндексыГородов.Город КАК Город
	|ИЗ
	|	РегистрСведений.ИндексыГородов КАК ИндексыГородов
	|ГДЕ
	|	ИндексыГородов.Индекс = &Индекс
	|
	|СГРУППИРОВАТЬ ПО
	|	ИндексыГородов.Город
	|
	|УПОРЯДОЧИТЬ ПО
	|	Город";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Объект.ГородТранслит = "";
		Сообщить("Город не поддерживается! Проверьте корректность индекса.");
		Возврат;
	КонецЕсли;
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Объект.ГородТранслит = Выборка.Город;
		Возврат;
	КонецЕсли;
	
	Элементы.ГородТранслит.СписокВыбора.Очистить();
	Объект.ГородТранслит = "";
	Пока Выборка.Следующий() Цикл
		Элементы.ГородТранслит.СписокВыбора.Добавить(Выборка.Город);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборГородаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.ГородТранслит = ВыбранныйЭлемент.Значение;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
